[
    {
        "name": "Intro",
        "trigger": "level_start",
        "level_nid": "0",
        "condition": "True",
        "commands": [],
        "only_once": false,
        "priority": 20,
        "_source": [
            "change_background;BlackBackground",
            "s;???;So there I was, yeah? Fighting for my life over a pile of rubble!|And that's when... it happened.",
            "change_background;House",
            "multi_add_portrait;Livvy;Left;Ben;MidRight;Aphi;FarRight",
            "s;Livvy;The middle of the room EXPLODES right as I'm going for another bandit!|And we're all looking around, yeah?|Dazed and confused, scratching our heads, \"what the hell happened,\"|when suddenly... Nothric soldiers.|Dozens of the bastards, swarming my digsite like a bunch of cockroaches!",
            "s;Ben;As if the bandits weren't enough,|now you're saying the military got involved in this whole kerfuffle?|I don't buy it. Not one bit.",
            "s;Aphi;Oh, leave it alone, Ben. The lady's trying to tell you a cool story!|And here you are dumping all over her hard work! Give it a rest...",
            "s;Livvy;The little girl's right. This isn't some yarn I'm trying to spin you!",
            "remove_portrait;Aphi",
            "add_portrait;Mae;FarRight",
            "s;Mae;What I don't get is, what would the military even want out of you?|Feels like we do half their damn job,|and now you're telling me they've got time to go harrassing total nobodies?",
            "s;Livvy;Hey! I'm not a \"total nobody!\"",
            "multi_remove_portrait;Mae;Ben",
            "add_portrait;Aphi;Right",
            "s;Aphi;And I'm not a \"little girl,\" but you don't see me complaining, do you...?",
            "s;Livvy;I am a foremost mind on... a manner of subjects! Not that you would know.|I doubt you've even heard of half the fields I've dabbled in. Charlatans...",
            "s;Aphi;Ooohohoho! You're on, lady! List 'em!|I bet you a round of drinks that I've researched 'em all, just you watch!",
            "s;Livvy;A-alright, I will! Transmutation!",
            "s;Aphi;Mhm! That's grade school stuff!",
            "s;Livvy;Transfiguration!",
            "s;Aphi;That's, like, the same thing, but yeah, sure, I've done that too!",
            "s;Livvy;Bioalchemy, biosynthesis, biomancy...",
            "s;Aphi;Yeah, yeah, we've all done a little-",
            "s;Livvy;... biocosmology, bio-temporamancy...",
            "multi_remove_portrait;Livvy;Aphi",
            "multi_add_portrait;Ben;Left;Mae;Right",
            "s;Ben;She and Aphi'll be at that for a while. So, Mae... You sure she's...?",
            "s;Mae;Definitely. Still not sure why our contact's intel on her was so bogus...|but who else could it be but her?",
            "s;Ben;I dunno, this all smells fishy to me.|I mean, mercenary work's one thing, but this is basically bounty hunting!|It'd be fine if she seemed like a bad sort, but I mean... look at her.|She's maybe got a bit of an ego to her, but she doesn't seem... \"evil.\"",
            "s;Mae;... Yeah, you're right. You think we got played, or just got the jitters?",
            "s;Ben;Hard to say, but whoever put a bounty on her head's no friend of ours.|But if she's telling the truth about those soldiers, then I wonder if-",
            "add_portrait;Aphi;OffscreenRight",
            "s;Aphi;Okay! I yield! I yield! Dang, lady, how do you even find time to sleep?",
            "multi_remove_portrait;Mae;Ben;Aphi",
            "multi_add_portrait;Livvy;Left;Aphi;Right",
            "s;Livvy;Hah! If I ever do, I'll let you know.",
            "s;Aphi;That's crazy, though. What's a girl like you doing studying chronomancy?",
            "s;Livvy;Ah, come on, I gotta keep a couple secrets, eh? Now about those drinks-",
            "multi_remove_portrait;Aphi;Livvy",
            "multi_add_portrait;Livvy;FarLeft;Ben;MidLeft;Mercenary1;Right",
            "s;Mercenary1;There she is. Nice job tracking her down for us. You're a real helper.",
            "s;Livvy;Tracking me down...? Ben, you-!",
            "s;Ben;Bad news for you, bud. The job's a wash. Pretty sure it's a set-up.|I'm not about to let my people take the fall for whatever's going on here.",
            "s;Mercenary1;So... you'll leave the bounty to us?|How generous! I see the tales about Ben and Zo's Mercenaries are true!|Utterly magnanimous, selfless to a fault, and very, veeery stupid.",
            "s;Ben;... Yeah. We get up to some pretty stupid stunts, that's for sure.|Mae!",
            "multi_remove_portrait;Ben;Mercenary1;Livvy",
            "multi_add_portrait;Livvy;Left;Ben;MidRight;Mae;FarRight",
            "s;Mae;You're right. That WAS stupid.",
            "s;Ben;If it's stupid and it works, it's a good idea. We gotta get moving.|You there, Livvy! You coming, or what?",
            "s;Livvy;You know my name, too...?|Stay away from me. You're not gonna take me back with you, you-!",
            "remove_portrait;Ben",
            "add_portrait;Aphi;MidRight",
            "s;Aphi;Hey, hey, relax! We didn't kill those guys for fun! At least, I think not.|Mae...?",
            "s;Mae;Obviously not???",
            "s;Aphi;Yeah! We're gonna get you outta here!",
            "remove_portrait;Aphi",
            "add_portrait;Ben;MidRight",
            "s;Ben;Mhm. Whoever hired us isn't telling us the truth, and you're in danger.|We don't leave innocent people to die, and we don't let people lie to us.|You follow?",
            "s;Livvy;... Fine. Don't expect me to trust you just because of sentimental talk.|You came here to kill me, didn't you?",
            "s;Ben;We came here to... collect... you...?",
            "s;Livvy;And take me to...?",
            "s;Ben;Our employer! Who... probably would have, uh... look, we should move out.|We're killing daylight, and I bet we're already outnumbered again.",
            "s;Livvy;Again? What's that supposed to mean?",
            "s;Mae;We're used to being outnumbered four to one or so. It's normal to us.",
            "s;Livvy;... Fantastic. Abducted by a pack of gloryhound bounty hunters. Hmph.|Very well. Let's make this quick then.",
            "change_background",
            "add_group;Players",
            "multi_add_portrait;Ben;Left;Nate;Right",
            "s;Nate;What the hell, bro. Why do you go for drinks, then kill a bunch of goons!?|Do you know what drinking is??",
            "s;Ben;Look, it wasn't exactly Plan A, but that's the situation we're in, now.|You still got your sword on you?",
            "s;Nate;Yeah, I brought it in case we had to go \"drinking\" on the job again...",
            "s;Ben;Well, remember what I taught you, and uh... \"b-bottom's up\"...?",
            "multi_remove_portrait;Ben;Nate",
            "wait;240",
            "add_portrait;Ben;Left",
            "s;Ben;... Let's just win this thing..."
        ],
        "nid": "0 Intro"
    }
]